<a href="https://colab.research.google.com/github/FGalvao77/others-knowledge-in-python-for-data-science/blob/main/Convertendo_tipo_de_dado.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# importando a biblioteca 
import pandas as pd

In [2]:
# exemplo 1
nome = pd.Series(['João', 'Maria', 'Letícia','Roberto', 'Joaquim'])
altura = pd.Series([1.80, 1.79, 1.76, 1.81, 1.75], dtype='object')
idade = pd.Series([29, 24, 30, 20, 50], dtype='object')
matriculado = pd.Series([True, True, False, True, False], dtype='object')

In [3]:
# instanciando os dados em um dataframe
df = pd.DataFrame({
    'nome': nome,
    'altura': altura,
    'idade': idade,
    'matriculado': matriculado
})

# imprimindo o dataframe criado
df

      nome altura idade matriculado
0     João    1.8    29        True
1    Maria   1.79    24        True
2  Letícia   1.76    30       False
3  Roberto   1.81    20        True
4  Joaquim   1.75    50       False

In [4]:
# visualizando os tipos de dados no df
df.dtypes

nome           object
altura         object
idade          object
matriculado    object
dtype: object

In [5]:
# realizando a transformação dos tipos de dados do df
novo_df = df.convert_dtypes(convert_boolean=False)
novo_df.dtypes

nome            string
altura         float64
idade            Int64
matriculado      Int64
dtype: object

In [6]:
# visualizando o novo dataframe
novo_df

      nome  altura  idade  matriculado
0     João    1.80     29            1
1    Maria    1.79     24            1
2  Letícia    1.76     30            0
3  Roberto    1.81     20            1
4  Joaquim    1.75     50            0

In [7]:
# exemplo 2
nome = pd.Series(['João', 'Maria', 'Letícia','Roberto', 'Joaquim'])
altura = pd.Series([1.80, 1.79, 1.76, 1.81, 1.75], dtype='object')
idade = pd.Series([29, 24, 30, 20, 50], dtype='object')
matriculado = pd.Series(['Sim', 'Sim', 'Não', 'Sim', 'Não'], dtype='object')

In [8]:
# instanciando os dados em um dataframe
df = pd.DataFrame({
    'nome': nome,
    'altura': altura,
    'idade': idade,
    'matriculado': matriculado
})

# visualizando o dataframe criado
df

      nome altura idade matriculado
0     João    1.8    29         Sim
1    Maria   1.79    24         Sim
2  Letícia   1.76    30         Não
3  Roberto   1.81    20         Sim
4  Joaquim   1.75    50         Não

In [9]:
# visualizando os tipos de dados presentes no dataframe
df.dtypes

nome           object
altura         object
idade          object
matriculado    object
dtype: object

In [10]:
# realizando a conversão dos tipos de dados 
novo_df = df.convert_dtypes(convert_boolean=False)
novo_df.dtypes

nome            string
altura         float64
idade            Int64
matriculado     string
dtype: object

In [11]:
# visualizando o novo dataframe
novo_df

      nome  altura  idade matriculado
0     João    1.80     29         Sim
1    Maria    1.79     24         Sim
2  Letícia    1.76     30         Não
3  Roberto    1.81     20         Sim
4  Joaquim    1.75     50         Não

In [12]:
# excluindo a primeira coluna do "novo_df" e instanciando em uma nova variável
df_tratado = novo_df.iloc[:, 1:]

# visualizando o "df_tratado"
df_tratado

   altura  idade matriculado
0    1.80     29         Sim
1    1.79     24         Sim
2    1.76     30         Não
3    1.81     20         Sim
4    1.75     50         Não

In [13]:
# visualizando o tipo de dado presente em cada coluna
# perceba que, na coluna "matriculado" o tipo de dado é uma "string"
df_tratado.dtypes

altura         float64
idade            Int64
matriculado     string
dtype: object

In [14]:
# convertendo a variável categórica (da coluna "matriculado") para variável númerica
# 0: Não
# 1: Sim
for col in df_tratado.select_dtypes(include='string').columns:
  df_tratado[col] = df_tratado[col].astype('category')

  # imprimindo o mapeamento
  print(col, '\t', dict(enumerate(df_tratado[col].cat.categories)), end='\n\n')

  df_tratado[col] = df_tratado[col].cat.codes

matriculado 	 {0: 'Não', 1: 'Sim'}

In [15]:
# visualizando o "df_tratado" após a conversão da variável categórica para númerica
df_tratado.head()

   altura  idade  matriculado
0    1.80     29            1
1    1.79     24            1
2    1.76     30            0
3    1.81     20            1
4    1.75     50            0

In [16]:
# informações gerais do df
df_tratado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   altura       5 non-null      float64
 1   idade        5 non-null      Int64
 2   matriculado  5 non-null      int8
dtypes: Int64(1), float64(1), int8(1)
memory usage: 218.0 bytes

In [17]:
# visualizando o tipo de dado em cada coluna
df_tratado.dtypes

altura         float64
idade            Int64
matriculado       int8
dtype: object

In [18]:
# instalando ruby
!pip install ruby

Collecting ruby
  Downloading https://files.pythonhosted.org/packages/6a/cb/4b6ddfc4139c649949dbcebbd1f50fff07b04317e2a31fa3d06394c7915a/ruby-0.0.2-py3-none-any.whl
Requirement already satisfied: nltk<4 in /usr/local/lib/python3.7/dist-packages (from ruby) (3.2.5)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from nltk<4->ruby) (1.15.0)
Installing collected packages: ruby
Successfully installed ruby-0.0.2

In [19]:
# instalando julia
!pip install julia

Collecting julia
  Downloading https://files.pythonhosted.org/packages/79/15/b7ffd6aab0902a8430db614f964c2516db52f847a3c42d99904de72c1faa/julia-0.5.6-py2.py3-none-any.whl (67kB)
     |████████████████████████████████| 71kB 3.0MB/s
Installing collected packages: julia
Successfully installed julia-0.5.6